{
  "slug": "gift-automation",
  "topic": "Automating gift-giving for birthdays, holidays, anniversaries, and thank-you occasions so the client spends under 30 seconds per gift decision. The core problem: busy executives forget important dates, scramble last-minute for generic gifts, and feel guilty about dropped balls in relationships that matter. The solution: a proactive system where the EA monitors upcoming occasions, researches personalized gift options based on recipient preferences and history, presents curated choices, handles ordering and shipping, and tracks thank-you responses. Key workflows: one-time database setup with People/Gifts/Events tables, EA backfill from email receipts to populate gift history, recurring approval flow where EA presents 5 options and client replies with number 1-5, thank-you tracking to log reactions and improve future recommendations. Edge cases: international shipping requiring 6+ weeks lead time, corporate compliance limits on gift values, last-minute additions when client meets someone new. Success means: never missing an important date, receiving 'how did you know?' reactions from recipients, reclaiming 10+ hours per year previously spent on gift stress, and eliminating gift-related guilt entirely.",
  "area": "relationships",
  "research_guidance": "Focus on practical delegation systems, not DIY reminder hacks. The reader is always the client, never the EA. Prioritize sources: athena.com/resources, thestrategist.com for gift research methodology, wirecutter.com for product research patterns, zapier.com/blog for automation patterns, airtable.com/templates for database structures. Avoid: affiliate listicles, Amazon best seller roundups, generic gift guides, Product Hunt, random Reddit posts, any source that focuses on self-managed reminders rather than delegation. Must cover: Airtable or Notion database setup with People table (name, relationship, preferences, important dates), Gifts table (what, when, recipient, reaction), Gift Events table (upcoming occasions); historical gift population from email receipts; 30-day reminder cadence configuration; the exact approval flow where EA sends 5 options and client replies with a number; international shipping handling (use local retailers, 6+ week lead time); corporate gift compliance (dollar limits, tracking for tax). Do not cover: specific gift recommendations (those are per-recipient and change), gift card strategies, DIY calendar reminder setups, anything requiring client to do ongoing work. Quality signals in sources: specific Airtable/Notion templates with field structures, time estimates per step, real examples of approval message flows, edge case handling. Red flags in sources: vague 'systemize your gifts' advice with no specifics, no mention of delegation or EA involvement, focus on apps the client has to manage themselves. Depth: practitioner level, enough detail to actually implement. Frame the entire playbook around time ROI (minutes invested vs hours saved) and relationship investment (small consistent effort compounds into stronger relationships)."
}
